Autodesk.Revit.DB.Structure.IRebarUpdateServerProxy.GetHandlesPosition(Autodesk.Revit.DB.Structure.RebarHandlePositionData)
This function is supposed to provide the positions of handles defined in GetCustomHandles(). These positions will be shown on screen when the bar constraints are edited.
If a position for a handle isn't provided, that handle will not be represented on screen while edit constraints.
This function is called when edit constraints command is lunched or during edit constraints after a constraint was changed and the curve calculation was done.
handlePositionData:
Use the members of this class to access the inputs and define the handle positions for this free form rebar.
Returns:
Returns true if calculation of handle positions was successful, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.IRebarUpdateServerProxy.TrimExtendCurves(Autodesk.Revit.DB.Structure.RebarTrimExtendData)
This function is supposed to trim or extend curves that were obtained from calling GenerateCurves(). Also in this function can be set new constraints for start and end handles.
Remarks:
This function is called in the regeneration context when at least one data in trimExtendData parameter was changed. It is called immediately after GenerateCurves() and only if GenerateCurves() returns true.
If new constraints were created for start or end handle, a new regeneration will take place and the new constraints will become the rebar's actual constraints.
If new curves will be added by calling TrimExtendData.AddBarGeometry(), the existing curves in Rebar element will be replaced with these curves. It will not add curves to the existing ones.
trimExtendData:
Use the members of this class to access the inputs and define any trim/extend actions to be taken for bars in the free form rebar.
Returns:
Returns true if the trim/extend was successful, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.IRebarUpdateServerProxy.GenerateCurves(Autodesk.Revit.DB.Structure.RebarCurvesData)
This function is supposed to calculate the bars in set based on data received in curvesData parameter.
Remarks:
This function is called in the regeneration context when at least one data in curvesData parameter was changed.
curvesData:
Use the members of this class to access the inputs and define the output curves that make up the free form rebar.
Returns:
Returns true if the curve generation was successful, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.IRebarUpdateServerProxy.GetCustomHandleName(Autodesk.Revit.DB.Structure.RebarHandleNameData)
This function should return the name of the handle.
Remarks:
This function is called during edit constraints command when the mouse is over a handle or the funtion RebarConstrainedHandle.GetCustomHandleName() is called.
handleNameData:
The class used to output the rebarHandle name.
Returns:
Returns true if the handle name is defined successfully, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.IRebarUpdateServerProxy.GetCustomHandles(Autodesk.Revit.DB.Structure.RebarHandlesData)
This function should define all handles that the Rebar has. This function is called when the Rebar is created.
Remarks:
Revit consider the execution failed if we have duplicate tags for custom, start and end handles.
handlesInfoData:
Use the methods on this class to define the handles for the free form rebar. Revit will use these handles to create appropriate RebarConstraints.
Returns:
Returns true if the handles were defined successfully, false otherwise.
Since:
2018